{
    "Franco": {
        "descriptionSpanish": "\n¡Hola! Gracias por interesarte en mi perfil profesional :)\n\nMi nombre es Franco Carlomagno, tengo 22 años y actualmente resido en España desde hace aproximadamente dos años. Desde que emigré de mi país con dieciocho años, he tenido la posibilidad de aprender muchísimas cosas que me han permitido crecer tanto personal como profesionalmente. Mis pasiones son fundamentalmente dos, los videojuegos y el desarrollo de aplicaciones. Aunque curiosamente no me gustaría dedicarme al desarrollo de videojuegos, sí que me gustaría dedicarme a todo lo que rodea a la presentación de dichos proyectos en la web y las aplicaciones que pueden llegar a desarrollarse para complementar dichos proyectos. Gracias a que dedico mi tiempo libre a aquello con lo que me gano la vida, mis habilidades en el sector de desarrollo se ven en crecimiento constante, pero no bajo teoría o esfuerzo de mejorar laboralmente, sino bajo práctica y genuina curiosidad. Trabajo como desarrollador Font-end, haciendo uso de diferentes tecnologías y lenguajes que facilitan dicha y que además entregan un producto de mejor calidad al cliente final.\n\nLas herramientas y lenguajes que utilizo en mi día a día son variados, pero son principalmente los siguientes: HTML, JavaScript, CSS, React, Python, JSON, SaaS, GitHub, Gatsby, Figma, Vtex y Netlify. Manejo muchas otras herramientas y lenguajes, incluso he realizado varios proyectos de backend, pero en este portafolio solo vas a encontrar aquello con lo que me siento cómodo de trabajar, porque es la manera en la que siento que puedo entregar una mejor calidad en el producto final. Aunque por supuesto, siempre estoy dispuesto a prender cosas nuevas y a hacer más grande el repertorio de herramientas con las que trabajo. Como dato adicional, en mi juventud me dedique a trabajar como editor de video y gestor de contenidos, por lo que también, me agrada y me brinda una amplia visión del mundo multimedia.\nSi algo de lo que aquí he escrito, encaja con aquello que el perfil profesional a contratar que estás buscando :) no dudes en contactarme, que te aseguro que de no terminar teniendo una buena relación laboral, terminaremos teniendo una agradable y amena plática.\n\nTe dejo mis datos de contacto y te agradezco mucho que hayas leído todo lo aquí expuesto.\n\nfrancolucianocarlomagno@gmail.com \n\n +34 615 036 581",
        "descriptionEnglish": "\nHi! Thank you for taking an interest in my professional profile :)\n\nMy name is Franco Carlomagno, I'm 22 years old and currently residing in Spain for about two years. Since I emigrated from my country when I was eighteen, I have had the opportunity to learn many things that have allowed me to grow both personally and professionally. My passions are fundamentally two, video games and app development. Although interestingly, I wouldn't like to work on game development, I would like to work on everything surrounding the presentation of these projects on the web and the apps that can be developed to complement these projects. Thanks to the fact that I spend my free time on what I make a living from, my skills in the development sector are constantly growing, not under the theory or effort to improve my work, but through practice and genuine curiosity. I work as a Front-end developer, using different technologies and languages that facilitate this and that also deliver a better quality product to the end customer.\n\nThe tools and languages I use in my day to day life are varied, but the following are mainly: HTML, JavaScript, CSS, React, Python, JSON, SaaS, GitHub, Gatsby, Figma, Vtex and Netlify. I handle many other tools and languages, I have even done several back-end projects, but in this portfolio you will only find what I feel comfortable working with, because it's the way I feel I can deliver a better quality in the final product. Of course, I'm always willing to learn new things and make my toolbox bigger. As an additional note, in my youth I worked as a video editor and content manager, so I also like and gives me a wide vision of the multimedia world.\nIf something I've written here fits what you're looking for in the professional profile to hire, don't hesitate to contact me, I can assure you that even if we don't end up having a good working relationship, we will end up having a pleasant and enjoyable conversation.\n\nHere are my contact details and I really appreciate that you have read everything I have written.\n\nfrancolucianocarlomagno@gmail.com\n\n+34 615 036 581",
        "tools": {
            "lenguages": [
                {
                    "1": {
                        "name": "HTML",
                        "image": {
                            "path": "htmlLogo",
                            "width": "61px",
                            "height": "69px"
                        },
                        "fontSize": "36px",
                        "type": "lenguage",
                        "color": "#E34F26"
                    }
                },
                {
                    "2": {
                        "name": "PYTHON",
                        "image": {
                            "path": "pythonLogo",
                            "width": "69px",
                            "height": "69px"
                        },
                        "fontSize": "24px",
                        "type": "lenguage",
                        "color": "#DB9B00"
                    }
                },
                {
                    "3": {
                        "name": "CSS",
                        "image": {
                            "path": "cssLogo",
                            "width": "62px",
                            "height": "62px"
                        },
                        "fontSize": "36px",
                        "type": "lenguage",
                        "color": "#2965F1"
                    }
                },
                {
                    "4": {
                        "name": "REACT",
                        "image": {
                            "path": "reactLogo",
                            "width": "68px",
                            "height": "59px"
                        },
                        "fontSize": "32px",
                        "type": "lenguage",
                        "color": "#3E5385"
                    }
                },
                {
                    "5": {
                        "name": "JAVASCRIPT",
                        "image": {
                            "path": "javascriptLogo",
                            "width": "55px",
                            "height": "55px"
                        },
                        "fontSize": "16px",
                        "type": "lenguage",
                        "color": "#DAB700"
                    }
                },
                {
                    "6": {
                        "name": "JSON",
                        "image": {
                            "path": "jsonLogo",
                            "width": "55px",
                            "height": "55px"
                        },
                        "fontSize": "32px",
                        "type": "lenguage",
                        "color": "#636363"
                    }
                },
                {
                    "7": {
                        "name": "VEGAS",
                        "image": {
                            "path": "vegasLogo",
                            "width": "55px",
                            "height": "55px"
                        },
                        "fontSize": "24px",
                        "type": "lenguage",
                        "color": "#003E52"
                    }
                },
                {
                    "8": {
                        "name": "SASS",
                        "image": {
                            "path": "sassLogo",
                            "width": "55px",
                            "height": "55px"
                        },
                        "fontSize": "32px",
                        "type": "lenguage",
                        "color": "#793055"
                    }
                },
                {
                    "9": {
                        "name": "GITHUB",
                        "image": {
                            "path": "githubLogo",
                            "width": "55px",
                            "height": "55px"
                        },
                        "fontSize": "24px",
                        "type": "lenguage",
                        "color": "#2A937A"
                    }
                },
                {
                    "10": {
                        "name": "GATSBY",
                        "image": {
                            "path": "gatsbyLogo",
                            "width": "56px",
                            "height": "56px"
                        },
                        "fontSize": "24px",
                        "type": "lenguage",
                        "color": "#48365B"
                    }
                },
                {
                    "11": {
                        "name": "FIGMA",
                        "image": {
                            "path": "figmaLogo",
                            "width": "37px",
                            "height": "56px"
                        },
                        "fontSize": "32px",
                        "type": "lenguage",
                        "color": "#CA6257"
                    }
                },
                {
                    "12": {
                        "name": "NETLIFY",
                        "image": {
                            "path": "netlifyLogo",
                            "width": "56px",
                            "height": "56px"
                        },
                        "fontSize": "20px",
                        "type": "lenguage",
                        "color": "#32837B"
                    }
                },
                {
                    "13": {
                        "name": "VTEX",
                        "image": {
                            "path": "vtexLogo",
                            "width": "56px",
                            "height": "56px"
                        },
                        "fontSize": "36px",
                        "type": "lenguage",
                        "color": "#68293E"
                    }
                },
                {
                    "14": {
                        "name": "PHOTOSHOP",
                        "image": {
                            "path": "photoshopLogo",
                            "width": "57px",
                            "height": "55px"
                        },
                        "fontSize": "16px",
                        "type": "lenguage",
                        "color": "#001D26"
                    }
                },
                {
                    "15": {
                        "name": "ARCAPLANET",
                        "image": {
                            "path": "arcaplanetLogo",
                            "width": "96px",
                            "height": "96px"
                        },
                        "fontSize": "28px",
                        "type": "company",
                        "color": "#FFFFFF"
                    }
                },
                {
                    "16": {
                        "name": "ACCT",
                        "image": {
                            "path": "acctLogo",
                            "width": "96px",
                            "height": "96px"
                        },
                        "fontSize": "28px",
                        "type": "company",
                        "color": "#FFFFFF"
                    }
                }
            ]
        }
    }
}